
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Успеваемость.Записывать = Истина;
	Движения.Посещение.Записывать = Истина;
	Для Каждого ТекСтрокаРасписаниеВТаблице Из РасписаниеВТаблице Цикл  
		// регистр Успеваемость
		Движение = Движения.Успеваемость.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = ТекСтрокаРасписаниеВТаблице.Предмет;
		Движение.Номер = ТекСтрокаРасписаниеВТаблице.НомерСтроки;
		Движение.Результат = ТекСтрокаРасписаниеВТаблице.Оценка;      
		
		// регистр Посещение
		Движение = Движения.Посещение.Добавить();
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаРасписаниеВТаблице.Предмет;
		Движение.КоличествоПосещений = 1;
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	НаборЗаписей = РегистрыСведений.ДомашнееЗадание.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого СтрокаТабличнойЧасти Из РасписаниеВТаблице Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДЗ) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период=НачалоДня(Дата);
			НоваяЗапись.Предмет=СтрокаТабличнойЧасти.Предмет;
			НоваяЗапись.ДомашнееЗадание=СтрокаТабличнойЧасти.ДЗ;
		КонецЕсли;
		
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры


